### 二次元リストから生成

In [1]:
# ipynb形式のライブラリのインポート
%run ./lib.ipynb

In [2]:
import pandas as pd

In [3]:
# 1 各行を一つのリストとして並べる

list = [
    [1, 100, 0.33, 'AAA', 'AAA100'], 
    [2, 200, 0.67, 'BBB', 'BBB200'], 
    [3, 300, 1, 'CCC', 'CCC300'], 
    [4, 400, 1.33, 'DDD', 'DDD400'], 
    [5, 500, 1.67, 'EEE', 'EEE500'], 
    [6, 600, 2, 'FFF', 'FFF600']
]

# 2 表に変換
# pd.DataFrame(list) : pandasのDataFrameで表に変換
df = pd.DataFrame(list)
# 行名・列名は自動で割り振られた番号になっている

# 3 行名の変更
df.index = ['row0', 'row1', 'row2', 'row3', 'row4', 'row5']

# 4 列名の変更
df.columns = ['col0', 'col1', 'col2', 'col3', 'col4']

df

      col0  col1  col2 col3    col4
row0     1   100  0.33  AAA  AAA100
row1     2   200  0.67  BBB  BBB200
row2     3   300  1.00  CCC  CCC300
row3     4   400  1.33  DDD  DDD400
row4     5   500  1.67  EEE  EEE500
row5     6   600  2.00  FFF  FFF600

In [4]:
# 1 各行を一つのリストとして並べる
list = [
[1, 100, 0.33, 'AAA', 'AAA100'], 
[2, 200, 0.67, 'BBB', 'BBB200'], 
[3, 300, 1, 'CCC', 'CCC300'], 
[4, 400, 1.33, 'DDD', 'DDD400'], 
[5, 500, 1.67, 'EEE', 'EEE500'], 
[6, 600, 2, 'FFF', 'FFF600']]


#2 表に変換(オプションで行列名を指定)
ind = ['row0', 'row1', 'row2', 'row3', 'row4', 'row5']
col = ['col0', 'col1', 'col2', 'col3', 'col4']

df = pd.DataFrame(list, index=ind, columns=col)


df

      col0  col1  col2 col3    col4
row0     1   100  0.33  AAA  AAA100
row1     2   200  0.67  BBB  BBB200
row2     3   300  1.00  CCC  CCC300
row3     4   400  1.33  DDD  DDD400
row4     5   500  1.67  EEE  EEE500
row5     6   600  2.00  FFF  FFF600

In [5]:
# 1 各行を一つのリストにする
list = [
['row0', 1, 100, 0.33, 'AAA', 'AAA100'], 
['row1', 2, 200, 0.67, 'BBB', 'BBB200'], 
['row2', 3, 300, 1, 'CCC', 'CCC300'], 
['row3', 4, 400, 1.33, 'DDD', 'DDD400'], 
['row4', 5, 500, 1.67, 'EEE', 'EEE500'], 
['row5', 6, 600, 2, 'FFF', 'FFF600'], ]

# 2 表に変換
df = pd.DataFrame(list)

# 3 列名を変更
df.columns = ['', 'col0', 'col1', 'col2', 'col3', 'col4']

# 4 行名となる列を指定
df = df.set_index('')

df

      col0  col1  col2 col3    col4

row0     1   100  0.33  AAA  AAA100
row1     2   200  0.67  BBB  BBB200
row2     3   300  1.00  CCC  CCC300
row3     4   400  1.33  DDD  DDD400
row4     5   500  1.67  EEE  EEE500
row5     6   600  2.00  FFF  FFF600

In [6]:
# 1 各行ごとのリストを作成

listA = [1, 100, 0.33, 'AAA', 'AAA100']
listB = [2, 200, 0.67, 'BBB', 'BBB200']
listC = [3, 300, 1, 'CCC', 'CCC300']
listD = [4, 400, 1.33, 'DDD', 'DDD400']
listE = [5, 500, 1.67, 'EEE', 'EEE500']
listF = [6, 600, 2, 'FFF', 'FFF600']

# 2 まとめて表に変換

df = pd.DataFrame([listA, listB, listC, listD, listE, listF])

# 3 行名の変更
df.index = ['row0', 'row1', 'row2', 'row3', 'row4', 'row5']

# 4 列名の変更
df.columns = ['col0', 'col1', 'col2', 'col3', 'col4']

df

      col0  col1  col2 col3    col4
row0     1   100  0.33  AAA  AAA100
row1     2   200  0.67  BBB  BBB200
row2     3   300  1.00  CCC  CCC300
row3     4   400  1.33  DDD  DDD400
row4     5   500  1.67  EEE  EEE500
row5     6   600  2.00  FFF  FFF600